{
  "basics": {
    "name": "Jiashun Pang",
    "email": "xinguk2018@gmail.com",
    "phone": "18500450612",
    "url": "https://cocoj-p.github.io/",
    "summary": "Interdisciplinary researcher at the interface of Computational Mechanics, Applied Mathematics, and AI4Science, focusing on physics-informed modeling, ontology-driven reasoning, and machine-scientist workflows.",
    "location": {
      "city": "Beijing",
      "countryCode": "CN",
      "region": "Beijing"
    }
  },
  "work": [
    {
      "name": "Institute for Mechanics, Chinese Academy of Sciences",
      "position": "Research Assistant",
      "startDate": "2021-10-01",
      "endDate": "2025-10-01",
      "summary": "Developed computational modeling tools, ontology-driven reasoning frameworks, and LLM logic plugins, contributing to AI4Science platforms and applications in scientific research.",
      "highlights": [
        "MosaicX: physics-constrained patch atlas for model discovery",
        "OntoPilot: OWL DL + HermiT reasoning plugin for LLM safety",
        "Sessync: ontology generation and crowdsourced validation toolchain",
        "DDDA: data-driven dimensional analysis framework",
        "MechOn-fluid: fluid mechanics ontology and knowledge graph"
      ]
    }
  ],
  "volunteer": [
    {
      "organization": "Movers4Climate",
      "location": "Yunnan, China",
      "position": "Volunteer",
      "startDate": "2025-9-06",
      "endDate": "2025-9-13",
      "summary": "Served as Deputy Team Leader in a climate education volunteer program, delivering science outreach lessons to elementary school students and coordinating logistics for the team.",
      "highlights": [
        "Taught interactive classes on climate change awareness to primary school children",
        "Coordinated with local schools for scheduling and activity planning",
        "Managed logistics including teaching materials, transportation, and on-site support",
        "Drove team members and ensured safe and timely travel during the program"
      ]
    },
    {
      "organization": "Ofund foundation",
      "location": "Qinghai, China",
      "position": "Volunteer",
      "startDate": "2023-9-01",
      "endDate": "2023-9-15",
      "summary": "Led a volunteer team in rural Qinghai, coordinating climate and education outreach while conducting household visits and community surveys.",
      "highlights": [
        "Served as Team Leader, overseeing volunteer activities and coordinating with local schools",
        "Organized and delivered educational sessions for primary school students",
        "Managed team logistics, including scheduling, transportation, and teaching materials",
        "Conducted household visits and interviews to gather insights on local education and living conditions"
      ]
    },
    {
      "organization": "Ofund foundation",
      "location": "Qinghai, China",
      "position": "Volunteer",
      "startDate": "2018-9-01",
      "endDate": "2018-9-15",
      "summary": "Participated as a volunteer in rural education support, teaching mathematics to primary school students and conducting household visits in local communities.",
      "highlights": [
        "Taught mathematics classes to elementary school children in rural Qinghai",
        "Conducted household visits and interviews to understand local educational needs",
        "Supported team activities and assisted in lesson preparation and community engagement"
      ]
    }
  ],
  "education": [
    {
      "institution": "University of Manchester, Manchester, UK",
      "location": "Manchester, UK",
      "url": "https://www.manchester.ac.uk/",
      "area": "Fluid machanics",
      "studyType": "MSc",
      "startDate": "2020-10-01",
      "endDate": "2021-8-31",
      "courses": [
        "Fluid mechanics",
        "Computational Fluid mechanics"
      ]
    },
    {
      "institution": "University of Leeds, Leeds, UK",
      "location": "Leeds, UK",
      "url": "https://www.leeds.ac.uk/",
      "area": "Mechanical Engineering",
      "studyType": "BEng",
      "startDate": "2017-10-01",
      "endDate": "2020-08-31",
      "courses": [
        "Mechanics",
        "Advanced Mathmatics"
      ]
    },
    {
      "institution": "HK University of Science and Technology, HK, China",
      "location": "HK, China",
      "url": "https://hkust.edu.hk/",
      "area": "Robot design",
      "studyType": "Summary school",
      "startDate": "2018-6-01",
      "endDate": "2018-10-01"
    }
  ],
  "skills": [
    {
      "name": "Computational Mechanics & Applied Mathematics",
      "level": "Advanced",
      "icon": "fa-solid fa-cogs",
      "keywords": [
        "Continuum mechanics",
        "Fluid mechanics",
        "Physics-informed modeling",
        "Dimensional analysis",
        "Dynamical systems theory",
        "Nonlinear and asymptotic analysis",
        "Similarity methods",
        "Optimization",
        "Uncertainty quantification"
      ]
    },
    {
      "name": "AI4Science & Knowledge Graphs",
      "level": "Advanced",
      "icon": "fa-solid fa-brain",
      "keywords": [
        "Ontology modeling",
        "Semantic reasoning",
        "Trustworthy LLM logic plugins",
        "Machine-scientist workflows",
        "Automated model discovery",
        "Knowledge Graph"
      ]
    },
    {
      "name": "Software & Programming",
      "level": "Advanced",
      "icon": "fa-solid fa-code",
      "keywords": [
        "Python",
        "MATLAB",
        "Web development (React, Flask/FastAPI)",
        "App development (Qt, Docker)",
        "Git/GitHub",
        "CAD & 3D modeling (Solidworks)",
        "CFD tools (Basilisk, Commercial software)",
        "Semantic/KG tools (Protégé, Neo4j, OWL-LLM-Cookbook)"
      ]
    }
  ],
  "languages": [
    {
      "language": "Chinese Mandarin",
      "fluency": "Native speaker",
      "icon": ""
    },
    {
      "language": "English",
      "fluency": "Fluent",
      "icon": ""
    }
  ],
  "projects": [
    {
      "name": "MosaicX",
      "summary": "A physics-constrained framework for automated model discovery that transforms implicit relations into explicit patch atlases. By integrating uncertainty quantification across regions and experimental data, MosaicX constructs structured, queryable, and optimizable models for scientific discovery.",
      "highlights": [
        "Physics-informed model discovery",
        "Implicit-to-explicit function mapping",
        "Patch atlas construction",
        "Uncertainty quantification for regional integration",
        "Guidance for experiment design and data sampling",
        "Structured and optimizable system for scientific reasoning"
      ],
      "startDate": "2025"
    },
    {
      "name": "OntoPilot",
      "summary": "An ontology-driven framework integrating OWL DL modeling and HermiT reasoning under a closed-world assumption. Designed as a plugin for large language models, OntoPilot provides semantic guidance, consistency checking, and hallucination detection to enable safe and interpretable AI for scientific applications.",
      "highlights": [
        "Ontology modeling with OWL DL for formal knowledge representation",
        "HermiT reasoning engine for logical consistency and closed-world inference",
        "Integration with LLMs as a logic plugin",
        "Semantic guidance for trustworthy AI responses",
        "Hallucination detection and error reporting for interpretable AI"
      ],
      "startDate": "2024"
    },
    {
      "name": "Sessync",
      "summary": "An ontology generation and crowdsourced validation toolchain. Sessync enables researchers to submit ontology modeling tasks, open them to the community for peer review, and ensure quality assurance through crowdsourced evaluation workflows.",
      "highlights": [
        "Ontology task publishing and workflow management",
        "Crowdsourced peer review and validation",
        "Community-driven ontology improvement",
        "Quality assurance mechanisms for semantic models",
        "Integration with AI4Science knowledge graph pipelines"
      ],
      "startDate": "2022"
    },
    {
      "name": "MechOn-fluid",
      "summary": "An ontology-based knowledge graph for fluid mechanics, developed as a testbed for AI4Science tools and reasoning workflows. MechOn-fluid provides structured representations of fluid mechanics concepts, equations, and units to support ontology validation, semantic reasoning, and integration with automated modeling frameworks.",
      "highlights": [
        "Constructed ontology for fluid mechanics concepts and relations",
        "Formalized equations, units, and physical quantities using OWL DL",
        "Served as a benchmark for ontology validation and reasoning tools",
        "Integrated with Sessync for crowdsourced review and quality assurance",
        "Testbed for LLM plugin frameworks such as OntoPilot"
      ],
      "startDate": "2023"
    },
    {
      "name": "DDDA",
      "summary": "A data-driven dimensional analysis framework for discovering explicit dimensionless functions directly from experimental data, without requiring prior physical models or constraints.",
      "highlights": [
        "Performed dimensional analysis purely from experimental datasets",
        "Discovered explicit functional relationships without prior models",
        "Enabled interpretable mappings of experimental variables",
        "Served as a foundation for MosaicX in physics-informed model discovery",
        "Applied to scientific workflows for validation and experiment guidance"
      ],
      "startDate": "2021"
    }
  ]
}